CSI API ETABS v1
cDesignCompositeColumn Interface
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public interface cDesignCompositeColumn
Public Interface cDesignCompositeColumn
Dim instance As cDesignCompositeColumn
public interface class cDesignCompositeColumn
type cDesignCompositeColumn =  interface end
The cDesignCompositeColumn type exposes the following members.
Properties
Name | Description
AISC360_22
CSAS16_19
Eurocode_4_2004
Top
Methods
Name | Description
DeleteResults
GetCode
 Retrieves the composite column design code.
GetComboDeflection
GetComboStrength
GetDesignSection
GetGroup
GetResultsAvailable
 This function determines if the composite column design results are available.
GetSummaryResults
 Retrieves composite column design summary results
GetTargetDispl
GetTargetPeriod
ResetOverwrites
SetAutoSelectNull
SetCode
 Sets the composite column design code.
SetComboDeflection
SetComboStrength
SetDesignSection
SetGroup
SetTargetDispl
SetTargetPeriod
StartDesign
 Starts the composite column design.
VerifyPassed
VerifySections
Top
See Also
Reference
ETABSv1 Namespace